from books_sdk import get_book_by_id, get_author


print(get_author(get_book_by_id('AAECTkuGjWo1Imwr-_6UrN-nzbo89sd3WSM', '1')))

# Гипотеза 1: Неправильные скобки
# Способ проверки: Удалить весь код, кроме скобок, и проверить их количество и порядок get_book_by_id
# Установленный факт: ((()))
# Вывод: Гипотеза опроверглась, со скобками всё в порядке

# Гипотеза 2: Ошибка во вложенной функции
# Способ проверки: Запустить вложенную функцию отдельно от внешней
# Код для проверки: print(get_book_by_id('1', 'AAECTkuGjWo1Imwr-_6UrN-nzbo89sd3WSM'))
# Установленный факт: Программа выдаёт ошибку
# Вывод: Гипотеза подтвердилась

# Гипотеза 3: Проблема в типе данных, '1' должно быть числом
# Способ проверки: Заменить строку '1' на число 1
# Код для проверки: print(get_author(get_book_by_id(1, 'AAECTkuGjWo1Imwr-_6UrN-nzbo89sd3WSM')))
# Установленный факт: Ошибка не исправлена
# Вывод: Гипотеза не подтвердилась

# Гипотеза 4: Книги с номером 1 не существует
# Способ проверки: подставить другие числа
# Код для проверки: print(get_author(get_book_by_id(5, 'AAECTkuGjWo1Imwr-_6UrN-nzbo89sd3WSM')))
# Установленный факт: Ошибка не исправлена
# Вывод: Гипотеза не подтвердилась

# Гипотеза 5: Аргументы перепутаны местами
# Способ проверки: Поменять местами token  и book_id
# Код для проверки: print(get_book_by_id('AAECTkuGjWo1Imwr-_6UrN-nzbo89sd3WSM', 1))
# Установленный факт: Код работает
# Вывод: Гипотеза подтвердилась